{"Trump loyalist Kash Patel is confirmed as FBI director by the Senate despite deep Democratic doubts_10": {"timestamp": 1740080384.354785, "data": [{"Summary": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"Summary": "“I cannot imagine a worse choice,” Sen. Dick Durbin, D-Ill., told colleagues before the 51-49 vote by the GOP-controlled Senate.\nPatel raised alarm among Democrats for saying before he was nominated that he would “come after” anti-Trump “conspirators” in the federal government and the media.\nPatel wants to make the FBI accountable once again -– get back the reputation that the FBI has had historically for law enforcement,” Sen. Chuck Grassley, R-Iowa, chairman of the Senate Judiciary Committee, said before Patel was confirmed.\n“This is someone who lacks the character to do this job, someone who lacks the integrity to do this job.\nPatel later joined Trump’s administration, both as a counterterrorism official at the National Security Council and as chief of staff to the defense secretary."}, {"Summary": "Senator Jerry Moran met with Patel on Jan. 17-courtesy photo“I cannot imagine a worse choice,\" Sen. Dick Durbin, D-Ill., told colleagues before the 51-49 vote by the GOP-controlled Senate.\nSenator Jerry Moran during the vote count Thursday afternoon-image courtesy CSPANSenators Susan Collins of Maine and Lisa Murkowski of Alaska were the lone Republican holdouts.\nPatel wants to make the FBI accountable once again -– get back the reputation that the FBI has had historically for law enforcement,” Sen. Chuck Grassley, R-Iowa, chairman of the Senate Judiciary Committee, said before Patel was confirmed.\n“I am absolutely sure of this one thing: this vote will haunt anyone who votes for him.\nPatel later joined Trump’s administration, both as a counterterrorism official at the National Security Council and as chief of staff to the defense secretary."}, {"Summary": "ToplineThe Senate confirmed Kash Patel as FBI director Thursday, despite Sens.\nFBI Director Christopher Wray announced his intention to resign, clearing the way for Trump to install Patel as the next FBI chief.\nTrump announced he’s nominating Patel to be the next FBI director, following reports that Patel was being floated for the position.\nWho Is Kash Patel?\nKey BackgroundTrump named Patel as his FBI nominee in November, even before current FBI Director Christopher Wray announced in December he intended to resign."}, {"Summary": "But while both Gabbard and Kennedy are relatively recent allies of Trump, Patel was scrutinised for his longstanding allegiance to the Republican leader and real estate tycoon.\n“ I do not agree with commutation of any sentence of any individual who committed violence against law enforcement,” Patel responded.\nThere will be no politicisation of the FBI,” Patel said in an interaction with Senator Chris Coons.\n“Senator, I will always obey the law,” Patel replied, appearing to sidestep the question.\nExpanding law enforcement capabilitiesPatel, meanwhile, sought to play up one of his selling points: that he would flesh out the FBI’s law enforcement capabilities."}, {"Summary": "Kash Patel, facing questions about his independence, says FBI reform is his focustoggle caption Anna Moneymaker/Getty ImagesWe're following the confirmation hearings for the incoming Trump administration.\nSponsor Message\"Our national security is at threat both internally and externally,\" he told the committee.\nHe has held senior national security jobs, sold self-branded merchandise online and written a children's book called The Plot Against the King, featuring a wizard named Kash and a king named Donald.\nIt also helped him land a job on Trump's National Security Council and later as a top aide to the director of national intelligence and to the secretary of defense.\nWhen asked if he would let Musk have input on personnel, Patel repeated the FBI would be independent."}, {"Summary": "Midland Memorial Hospital’s Critical Care and Progressive Care Units were both just awarded the Beacon Award for Excellence from the American Association of Critical-Care Nurses (AACN).\nThe AACN, based out of Aliso Viejo, California, recognized Midland Memorial Hospital’s Critical Care Unit with a silver-level Beacon Award for Excellence and Midland Memorial Hospital’s Progressive Care Unit with a bronze-level Beacon Award for Excellence, making them the only designated units in the Permian Basin, a news release said.\nThe Beacon Award for Excellence recognizes unit caregivers who improve outcomes and align practices with AACN’s six Healthy Work Environment Standards.\n“The Beacon Award for Excellence recognizes caregivers in outstanding units whose consistent and systematic approach to evidence-based care optimizes patient outcomes.\n“They continue to show their dedication to providing quality patient care to our community.”To learn more, visit www.aacn.org/beaconLike this: Like Loading...Related"}, {"Summary": "MADRID (AP) — Former Spanish soccer boss Luis Rubiales was found guilty of sexually assaulting player Jenni Hermoso on Thursday for kissing her after the 2023 Women’s World Cup final.\nMADRID (AP) — Former Spanish soccer boss Luis Rubiales was found guilty of sexually assaulting player Jenni Hermoso on Thursday for kissing her after the 2023 Women’s World Cup final.\nThe kiss sparked outrage in Spain and marred the celebrations of Spain’s first Women's World Cup title.\nHermoso testified that she “felt disrespected” by Rubiales after winning the World Cup.\nThe kiss prompted widespread outrage in society beyond soccer, and ignited one of the most embarrassing scandals in the history of Spanish soccer."}, {"Summary": "President-elect Donald Trump’s stunning announcement that he will nominate Kash Patel as FBI director sets the stage for a fresh round of turbulence at a law enforcement agency tasked with protecting the homeland and investigating federal crimes.\nWhat happens to the current FBI director?\nWray was appointed director by Trump in 2017 and technically has three years left on his 10-year tenure.\nTrump last week said he intended to nominate former Florida attorney general Pam Bondi to serve as attorney general.\nPatel has talked about disentangling the FBI’s intelligence-gathering operations — now a core function of the bureau’s mandate — from the rest of its operations."}, {"Summary": "It is already clear that confirming Patel through the US Senate is likely to be less than plain sailing.\nMike Rounds, a Republican senator from South Dakota, indicated that Patel could face a tough confirmation battle.\nThe senator also emphasised the separation of powers between president and Senate, signaling possible trouble for Patel.\nHe has long denigrated the FBI as a pillar of what he calls the “deep state” or the “corrupt ruling class”.\nBut he did highlight that Biden had kept Wray on as FBI chief, despite having inherited the official from Trump."}]}}